// toolbar items

"SToolbarSimpleMode"  = "Simple mode";
"SToolbarSimpleModeHint" = "Simple mode";

"SToolbarAdvancedMode"  = "Expert mode";
"SToolbarAdvancedModeHint" = "Expert mode";

"SToolbarEnterDFU" = "DFU";
"SToolbarEnterDFUHint" = "DFU";

"SToolbarLog" = "Log";
"SToolbarLogHint" = "Log";

"SToolbarHelp" = "Help";
"SToolbarHelpHint" = "Help";

"SToolbarExit" = "Exit";
"SToolbarExitHint" = "Exit";

// Bubbles

"SClickHere" = "Click here to continue";
"SITunesNotFound" = "You don't appear to have iTunes 8.0 or later version. You will need to upgrade iTunes to be able to restore with custom firmware bundles.";
"SFreeSpace" = "Available: %.02f MB";

// Select platform

"SSPText" = "Please select the device that you would like to modify.\nThis can be either an iPhone (3G, 3GS, 4) or iPod Touch (3G, 4G) or iPad or AppleTV 2G.";
"SSPTooltip" = "Click here for %@";
"SSPSelectPlatform" = "Select platform";

// Browse firmware

"SBFText" = "Select the firmware bundle .ipsw that you wish to use. You will be prompted if PwnageTool cannot find this file, as a last resort you can browse for these files and you will be prompted to ask if you would like to do so.";
"SBFSelectFirmware" = "Select firmware";
"SBFWrongFirmwareSelected" = "Wrong firmware bundle selected";
"SBFNoFirmwareFound" = "No firmware bundle found!\nWould you like to search the web for this file?";
"SBFBrowseFirmware" = "Browse for %@ firmware bundle.";
"SBFGoogleSearch" = "http://www.google.com/search?&q=%@+4.1+ipsw+download";
"SBFHint" = "You can switch to Expert mode and browse for %@ firmware bundle";
"SBFBrowseIPSW" = "Browse for IPSW...";

// Builder Menu

"SBMText" = "This screen allows the specific customization of your firmware bundle. Here you can adjust the settings of each section, once you have finished click \"build\" to compile and build the .ipsw file that will be used to restore your %@.";
"SBMSelectAction" = "Select menu option";
"SBMGeneral" = "General";
"SBMCydia" = "Cydia packages";
"SBMCustom" = "Custom packages";
"SBMLogos" = "Custom logos";
"SBMBuild" = "Build";

// Builder Settings

"SBSText" = "Here you can choose to \"Activate the phone\" which will allow a non-official activation or \"Enable baseband update\" which will allow you to modify the Baseband. The root partition size is also adjustable.";

// Builder Cydia

"SBYText" = "Here are individual settings for the individual packages that are provided by Cydia. Navigate through the tabs and configure the packages that you would like to preinstall. Remember you will also be able to install Cydia packages from the %@.";
"SBYDeletePackages" = "Do you want to delete selected Cydia packages from PwnageTool?";
"SBYDeleteSources" = "Do you want to delete selected Cydia sources from PwnageTool?";
"SBYBadURL" = "Sorry, but that URL is inaccessible.";

// Builder Custom

"SBCText" = "Here are listed package settings for your custom .ipsw . Here packages can be enabled or disabled and in the future specific packages will be distributed that will be enabled or disabled here.";

// Builder Logos

"SBLText" = "Here you can select custom graphics that you can use in place of the stock graphics, these will be used in replacement of the usual graphics and can be customized and added with the \"Browse\" buttons.";
"SBLBrowseBootLogo" = "Browse for Boot logo file.";
"SBLBrowseRecoveryLogo" = "Browse for Recovery logo file.";
"SBLBadImage" = "Sorry, but that doesn't appear to be the proper PNG file.";

// Builder Build

"SBDText" = "We are now building the .ipsw file that will be used to restore your %@.";
"SBDNoFreeSpace" = "You do not have enough free space.";
"SBDSaveIPSW" = "Save custom .ipsw file.";
"SBDSaveOnDesktop" = "We will now create an .ipsw file that you can use to restore your %@ with iTunes. This file will be placed on your desktop. Do you want to continue?";
"SBDAskForPwned" = "Has your %@ been Pwned before (does it have the pineapple logo)?\nIf you are unsure click No.";
"SBDRestore" = "Close the PwnageTool application, put your %@ into Recovery mode, start iTunes and restore with your custom firmware bundle.";
"SBDAreYouLegit" = "Do you have an %@ contract that would activate normally through iTunes?";

// Enter DFU

"SEDText" = "Use this screen to enter DFU mode. We will use this mode to restore on an unpwned %@.";
"SEDRestartGame" = "Failed to enter DFU mode.\nDo you like to try again?";
"SEDFailed" = "Failed to enter\nDFU mode";
"SEDWait" = "Please wait...";
"SEDSuccess" = "Successfully entered\nDFU mode";
"SEDRestore" = "Successfully entered DFU mode!\nClose the PwnageTool application, start iTunes and restore with your custom firmware bundle.";
"SEDConnect" = "Connect device to USB";
"SEDTurnOff" = "Turn off device";
"SEDPrepare" = "Prepare to press\nPower and Home buttons\nin 5 seconds...";
"SEDPressTwoButtons" = "Press Power and Home buttons!";
"SEDHoldTwoButtons" = "Hold Power and Home\nbuttons for 10 seconds...";
"SEDHoldTwoButtons2" = "Hold Power and Home\nbuttons for 10 seconds...\n\nPrepare to release\nPower button";
"SEDReleasePowerButton" = "Release Power button!";
"SEDHoldOneButton" = "Hold Home button\nfor 10 seconds...";
"SEDReleaseHomeButton" = "Release Home button!";

"SEDATVUnplug" = "Remove power cable\nfrom Apple TV";
"SEDATVPrepare" = "Prepare to press\nMenu and Play\nin 5 seconds...";
"SEDATVPressTwoButtons" = "Press Menu and Play!";
"SEDATVHoldTwoButtons" = "Hold Menu and Play\nfor 7 seconds\nthen release both...";
"SEDATVReleaseButtons" = "Release both buttons!";

//

"SNotEnoughFreeSpace" = "You have not enough free space in %@. Make sure you have at least %d MB free.";
"SLoadedIPSWFile" = "Loaded .ipsw file from '%@'.";
"SCustomIPSWNameFormat" = "%@_Custom_Restore.ipsw";

"SIPSWRecognized" = "Recognized .ipsw file as %@.";
"SIPSWNotRecognized" = "Can't recognize .ipsw file.";

"SCIMaking" = "Making custom %@ logo.";
"SCIMakingSuccess" = "OK";
"SCIMakingFailed" = "FAIL";

"SIPSWUnzip" = "Unzipping .ipsw file to %@.";
"SIPSWUnzipSuccess" = "OK";
"SIPSWUnzipFailed" = "FAIL";

"SFWPatch" = "Patching %@.";
"SFWPatchSuccess" = "OK";
"SFWPatchFailed" = "FAIL";

"SFSConvertToUDRW" = "Converting root filesystem to UDRW image.";
"SFSConvertToUDRWSuccess" = "OK";
"SFSConvertToUDRWFailed" = "FAIL";

"SFSResize" = "Resizing root filesystem to %@.";
"SFSResizeSuccess" = "OK";
"SFSResizeFailed" = "FAIL";

"SFSAttach" = "Attaching root filesystem to '%@'.";
"SFSAttachSuccess" = "OK";
"SFSAttachFailed" = "FAIL";

"SFSDetach" = "Detaching root filesystem from '%@'.";
"SFSDetachSuccess" = "OK";
"SFSDetachFailed" = "FAIL";

"SFSConvertToUDZO" = "Converting root filesystem to UDZO image.";
"SFSConvertToUDZOSuccess" = "OK";
"SFSConvertToUDZOFailed" = "FAIL";

"SFSASRScan" = "Scanning root filesystem with ASR.";
"SFSASRScanSuccess" = "OK";
"SFSASRScanFailed" = "FAIL";

"SFSPatch" = "Making %@.";
"SFSPatchSuccess" = "OK";
"SFSPatchFailed" = "FAIL";

"SCPAdding" = "Adding %@ custom package.";
"SCPAddingSuccess" = "OK";
"SCPAddingFailed" = "FAIL";

"SYPAdding" = "Adding %@ cydia package.";
"SYPAddingSuccess" = "OK";
"SYPAddingFailed" = "FAIL";

"SCPAddFailed" = "Failed to add %@ custom package. There is no free space left on root partition.";
"SYPAddFailed" = "Failed to add %@ cydia package. There is no free space left on root partition.";

"SBBPrepareUpdate" = "Preparing Baseband Update.";
"SBBPrepareUpdateSuccess" = "OK";
"SBBPrepareUpdateFailed" = "FAIL";

"SIPSWZip" = "Zipping .ipsw file.";
"SIPSWZipSuccess" = "OK";
"SIPSWZipFailed" = "FAIL";

"SIPSWBuildSuccess" = "Successfully built custom .ipsw file at '%@'.";
"SIPSWBuildFailed" = "Failed to build custom .ipsw file.";

"SRDAttach" = "Attaching %@ to '%@'.";
"SRDAttachSuccess" = "OK";
"SRDAttachFailed" = "FAIL";

"SRDDetach" = "Detaching %@ from '%@'.";
"SRDDetachSuccess" = "OK";
"SRDDetachFailed" = "FAIL";

"SRDResize" = "Resizing %@ to %@.";
"SRDResizeSuccess" = "OK";
"SRDResizeFailed" = "FAIL";

"SRDUpdating" = "Updating %@.";
"SRDUpdatingSuccess" = "OK";
"SRDUpdatingFailed" = "FAIL";

"SNoFreeSpaceLeft" = "No free space left on root partition.";

"SPDownloading" = "Downloading";
"SPDownloadFailed" = "FAIL";
"SPDownloaded" = "Downloaded";
"SPCanceled" = "Canceled";
"SPNewVersion" = "New version";

"SFailedToPrepareX1222IPSW" = "Failed to prepare x12220000_4_Recovery.ipsw file.";

